MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFE144/mcu.h
extern volatile __EMACxSA0bits_t EMACxSA0bits __asm__ ("EMACxSA0") __attribute__((section("sfrs"), address(0xBF882300)));
extern volatile uint32_t        EMAC1SA0CLR __attribute__((section("sfrs"),address(0xBF882304)));
extern volatile uint32_t        EMACxSA0CLR __attribute__((section("sfrs"),address(0xBF882304)));
extern volatile uint32_t        EMAC1SA0SET __attribute__((section("sfrs"),address(0xBF882308)));
extern volatile uint32_t        EMACxSA0SET __attribute__((section("sfrs"),address(0xBF882308)));
extern volatile uint32_t        EMAC1SA0INV __attribute__((section("sfrs"),address(0xBF88230C)));
extern volatile uint32_t        EMACxSA0INV __attribute__((section("sfrs"),address(0xBF88230C)));
#define EMAC1SA1 EMAC1SA1
extern volatile uint32_t   EMAC1SA1 __attribute__((section("sfrs"), address(0xBF882310)));
typedef union {
  struct {
    uint32_t STNADDR3:8;
    uint32_t STNADDR4:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SA1bits_t;
extern volatile __EMAC1SA1bits_t EMAC1SA1bits __asm__ ("EMAC1SA1") __attribute__((section("sfrs"), address(0xBF882310)));
#define EMACxSA1 EMACxSA1
extern volatile uint32_t   EMACxSA1 __attribute__((section("sfrs"), address(0xBF882310)));
typedef union {
  struct {
    uint32_t STNADDR3:8;
    uint32_t STNADDR4:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSA1bits_t;
extern volatile __EMACxSA1bits_t EMACxSA1bits __asm__ ("EMACxSA1") __attribute__((section("sfrs"), address(0xBF882310)));
extern volatile uint32_t        EMAC1SA1CLR __attribute__((section("sfrs"),address(0xBF882314)));
extern volatile uint32_t        EMACxSA1CLR __attribute__((section("sfrs"),address(0xBF882314)));
extern volatile uint32_t        EMAC1SA1SET __attribute__((section("sfrs"),address(0xBF882318)));
extern volatile uint32_t        EMACxSA1SET __attribute__((section("sfrs"),address(0xBF882318)));
extern volatile uint32_t        EMAC1SA1INV __attribute__((section("sfrs"),address(0xBF88231C)));
extern volatile uint32_t        EMACxSA1INV __attribute__((section("sfrs"),address(0xBF88231C)));
#define EMAC1SA2 EMAC1SA2
extern volatile uint32_t   EMAC1SA2 __attribute__((section("sfrs"), address(0xBF882320)));
typedef union {
  struct {
    uint32_t STNADDR1:8;
    uint32_t STNADDR2:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SA2bits_t;
extern volatile __EMAC1SA2bits_t EMAC1SA2bits __asm__ ("EMAC1SA2") __attribute__((section("sfrs"), address(0xBF882320)));
#define EMACxSA2 EMACxSA2
extern volatile uint32_t   EMACxSA2 __attribute__((section("sfrs"), address(0xBF882320)));
typedef union {
  struct {
    uint32_t STNADDR1:8;
    uint32_t STNADDR2:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSA2bits_t;
extern volatile __EMACxSA2bits_t EMACxSA2bits __asm__ ("EMACxSA2") __attribute__((section("sfrs"), address(0xBF882320)));
extern volatile uint32_t        EMAC1SA2CLR __attribute__((section("sfrs"),address(0xBF882324)));
extern volatile uint32_t        EMACxSA2CLR __attribute__((section("sfrs"),address(0xBF882324)));
extern volatile uint32_t        EMAC1SA2SET __attribute__((section("sfrs"),address(0xBF882328)));
extern volatile uint32_t        EMACxSA2SET __attribute__((section("sfrs"),address(0xBF882328)));
extern volatile uint32_t        EMAC1SA2INV __attribute__((section("sfrs"),address(0xBF88232C)));
extern volatile uint32_t        EMACxSA2INV __attribute__((section("sfrs"),address(0xBF88232C)));
#define USBCRCON USBCRCON
extern volatile uint32_t   USBCRCON __attribute__((section("sfrs"), address(0xBF884000)));
typedef struct {
  uint32_t USBWKUPEN:1;
  uint32_t USBRIE:1;
  uint32_t USBIE:1;
  uint32_t SENDMONEN:1;
  uint32_t BSVALMONEN:1;
  uint32_t ASVALMONEN:1;
  uint32_t VBUSMONEN:1;
  uint32_t PHYIDEN:1;
  uint32_t USBIDVAL:1;
  uint32_t USBIDOVEN:1;
  uint32_t :14;
  uint32_t USBWKUP:1;
  uint32_t USBRF:1;
  uint32_t USBIF:1;
} __USBCRCONbits_t;
extern volatile __USBCRCONbits_t USBCRCONbits __asm__ ("USBCRCON") __attribute__((section("sfrs"), address(0xBF884000)));
#define PRECON PRECON
extern volatile uint32_t   PRECON __attribute__((section("sfrs"), address(0xBF8E0000)));
typedef struct {
  uint32_t PFMWS:3;
  uint32_t :1;
  uint32_t PREFEN:2;
  uint32_t :20;
  uint32_t PFMSECEN:1;
} __PRECONbits_t;
extern volatile __PRECONbits_t PRECONbits __asm__ ("PRECON") __attribute__((section("sfrs"), address(0xBF8E0000)));
extern volatile uint32_t        PRECONCLR __attribute__((section("sfrs"),address(0xBF8E0004)));
extern volatile uint32_t        PRECONSET __attribute__((section("sfrs"),address(0xBF8E0008)));
extern volatile uint32_t        PRECONINV __attribute__((section("sfrs"),address(0xBF8E000C)));
#define PRESTAT PRESTAT
extern volatile uint32_t   PRESTAT __attribute__((section("sfrs"), address(0xBF8E0010)));
typedef struct {
  uint32_t PFMSECCNT:8;
  uint32_t :18;
  uint32_t PFMSEC:1;
  uint32_t PFMDED:1;
} __PRESTATbits_t;
extern volatile __PRESTATbits_t PRESTATbits __asm__ ("PRESTAT") __attribute__((section("sfrs"), address(0xBF8E0010)));
extern volatile uint32_t        PRESTATCLR __attribute__((section("sfrs"),address(0xBF8E0014)));
extern volatile uint32_t        PRESTATSET __attribute__((section("sfrs"),address(0xBF8E0018)));
extern volatile uint32_t        PRESTATINV __attribute__((section("sfrs"),address(0xBF8E001C)));
#define EBICS0 EBICS0
extern volatile uint32_t   EBICS0 __attribute__((section("sfrs"), address(0xBF8E1014)));
typedef struct {
  uint32_t :16;
  uint32_t CSADDR:16;
} __EBICS0bits_t;
extern volatile __EBICS0bits_t EBICS0bits __asm__ ("EBICS0") __attribute__((section("sfrs"), address(0xBF8E1014)));
#define EBICS1 EBICS1
extern volatile uint32_t   EBICS1 __attribute__((section("sfrs"), address(0xBF8E1018)));
typedef struct {
  uint32_t :16;
  uint32_t CSADDR:16;
} __EBICS1bits_t;
extern volatile __EBICS1bits_t EBICS1bits __asm__ ("EBICS1") __attribute__((section("sfrs"), address(0xBF8E1018)));
#define EBICS2 EBICS2
extern volatile uint32_t   EBICS2 __attribute__((section("sfrs"), address(0xBF8E101C)));
typedef struct {
  uint32_t :16;
  uint32_t CSADDR:16;
} __EBICS2bits_t;
